from objs.config import MAIN_CONFIG

MagicMap = {
  '투구': 
  {
      '힘': 400,
      '민첩성': 200,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '왕관': 
  {
      '힘': 0,
      '민첩성': 0,
      '맷집': 0,
      '체력': 0,
      '내공': 0,
      '명중': 0,
      '필살': 0,
      '운': 0,
      '회피': 0,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 0,
  },
  '머리': 
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션중'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '귀걸이': 
  {
      '힘': 200,
      '민첩성': 200,
      '맷집': 0,
      '체력': 0,
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 0,
  },
  '목걸이': 
  {
      '힘': 200,
      '민첩성': 200,
      '맷집': 0,
      '체력': 0,
      '내공': 10,
      '명중': 40,
      '필살': 40,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '어깨': 
  {
      '힘': 400,
      '민첩성': 100,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '상의': 
  {
      '힘': 400,
      '민첩성': 100,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '하의': 
  {
      '힘': 400,
      '민첩성': 100,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '장신구':
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 0,
      '체력': 0,
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '갑옷': 
  {
      '힘': 400,
      '민첩성': 100,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '허리': 
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '팔찌': 
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 0,
      '체력': 0,
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 0,
  },
  '장갑': 
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 100,
      '체력': MAIN_CONFIG['체력옵션저'],
      '내공': 10,
      '명중': 30,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '반지': 
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 0,
      '체력': 0,
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 0,
  },
  '슬호': 
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 200,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '신발': 
  {
      '힘': 200,
      '민첩성': 100,
      '맷집': 100,
      '체력': MAIN_CONFIG['체력옵션고'],
      '내공': 10,
      '명중': 20,
      '필살': 20,
      '운': 20,
      '회피': 20,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 200,
  },
  '무기': 
  {
      '힘': 1000,
      '민첩성': 0,
      '맷집': 300,
      '체력': MAIN_CONFIG['체력옵션중'],
      '내공': 10,
      '명중': 30,
      '필살': 30,
      '운': 30,
      '회피': 30,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 0,
  },
  '기타':
  {
      '힘': 0,
      '민첩성': 0,
      '맷집': 0,
      '체력': 0,
      '내공': 0,
      '명중': 0,
      '필살': 0,
      '운': 0,
      '회피': 0,
      '경험치': 0,
      '마법발견': 0,
      '공격력': 0,
      '방어력': 0,
  },
}

OptionName = ['힘', '민첩성', '맷집', '체력', '내공', '명중', '필살', '운', '회피', '경험치', '마법발견', '공격력', '방어력']

def applyMagic(self, level, num = 0, force = 0):
    from random import randint
    l = level
    option = {}
    position = self['계층']
    if position == '':
        return
    if self['종류'] != '무기' and self['종류'] != '방어구':
        return
    if self['옵션'] is not None and self['옵션'] != "":
        return
    if force == 1:
        level += 500
    else:
        if randint(0, 4) != 0:
            return
    if num == 0:
        num = randint(0, 5 * level // 10001 + 1)
    if randint(0, 10) == 10:
        num += 1
    if randint(0, 20) == 20:
        num += 1
    if randint(0, 50) == 50:
        num += 1

    if force == 1 and num == 0:
        num = 1

    if num == 0:
        return

    if num > 4:
        num = 4

    level += level * (num - 1) / 4

    if level > 10000:
        level = 10000

    optionMap = self.MagicMap[position]
    i = 0
    cnt = 0
    z = False
    while i < num:
        cnt += 1
        if cnt > 8:
            return
        nOp = randint(0, len(self.OptionName) - 1)
        op = self.OptionName[nOp]
        if op in option:
            continue
        maxval = optionMap[op]
        if maxval == 0:
            continue
        #val = randint(0, maxval)
        m = level * maxval / 10000 
        val = randint(int(m / 2), int(m * 1.5))
        if val > maxval:
            val = maxval
        if val == 0:
            continue
       
        if val > maxval * 0.3:
            z = True
       
        if op in ['공격력', '방어력']:
            self[op] = self[op] + val
        option[op] = val
        i += 1
    self['레벨'] = l
    if self['종류'] == '방어구':
        de = self['방어력']  
        d = int(l / 20)
        d += randint(-d/10, d/10)

        #if d > de * 3:
        #    z = True

        if de < d:
            self['방어력'] = d

    self.setOption(option)

    name = self['이름']
    name1 = self.getStrip('이름')
    print(name, self.getOptionStr())

    if num > 2 or z == True:
        self.setAttr('아이템속성', '버리지못함')
        self.setAttr('아이템속성', '줄수없음')

    if name == name1:
        if num < 3:
            self['이름'] = '[1;34m' + name + '[0;37m'
        elif num == 3:
            self['이름'] = '[1;37m' + name + '[0;37m'
        elif num == 4:
            self['이름'] = '[1;33m' + name + '[0;37m'


    
